In [1]:
import pandas as pd
import numpy as np
import pickle
from sklearn.linear_model import LinearRegression
from sklearn.svm import SVC
from sklearn.metrics import r2_score,accuracy_score
from sklearn.model_selection import train_test_split

In [2]:
df1 = pd.read_csv('Stud_part1.csv')
df2 = pd.read_csv('Stud_part2.csv')

In [3]:
df1.head()

   regnum  name  attendance  theorymarks
0     100  ravi          80           85
1     101  manu          50           60
2     102  raja          32           50
3     103  manu          85           80
4     104  arun          86           70

In [4]:
df2.head()

   regnum city studyhours cgpa
0     100  blr          3    4
1     101  chn          3    9
2     102  hyd          8    7
3     103  mum          3    6
4     104  del          1    7

In [5]:
np.unique(df2['studyhours'])

array(['1', '1500', '2', '3', '4', '5', '6', '7', '8', 'data', 'one'],
      dtype=object)

In [6]:
df2['studyhours'] = df2['studyhours'].replace(['1500','data','one'],np.nan)
df2['studyhours'].fillna(df2['studyhours'].median(),inplace=True)
df2['studyhours']=df2['studyhours'].astype(int)

In [7]:
np.unique(df2['studyhours'])

array([1, 2, 3, 4, 5, 6, 7, 8])

In [8]:
np.unique(df2['cgpa'])

array(['4', '5', '6', '7', '8', '800', '9', 'data', 'two'], dtype=object)

In [9]:
df2['cgpa'] = df2['cgpa'].replace(['800','data','two'], np.nan)
df2['cgpa'].fillna(df2['cgpa'].median(), inplace  = True)
df2['cgpa'] = df2['cgpa'].astype(int)

In [10]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   regnum      53 non-null     int64
 1   city        53 non-null     object
 2   studyhours  53 non-null     int32
 3   cgpa        53 non-null     int32
dtypes: int32(2), int64(1), object(1)
memory usage: 1.4+ KB

In [11]:
df = pd.merge(df1,df2, on = 'regnum', how = 'inner')

In [12]:
df.head()

   regnum  name  attendance  theorymarks city  studyhours  cgpa
0     100  ravi          80           85  blr           3     4
1     101  manu          50           60  chn           3     9
2     102  raja          32           50  hyd           8     7
3     103  manu          85           80  mum           3     6
4     104  arun          86           70  del           1     7

In [13]:
df = pd.get_dummies(df, columns=['city'])

In [14]:
df.columns

Index(['regnum', 'name', 'attendance', 'theorymarks', 'studyhours', 'cgpa',
       'city_blr', 'city_chn', 'city_del', 'city_hyd', 'city_jaipur',
       'city_mum', 'city_noida', 'city_pune'],
      dtype='object')

In [15]:
x = df[['attendance', 'theorymarks', 'studyhours']]
y = df['cgpa']

In [16]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.3,random_state=100)

In [17]:
mod1 = SVC()
mod1.fit(x_train,y_train)
ypred = mod1.predict(x_test)
accuracy_score(y_test,ypred)

0.1875

In [18]:
mod2 = LinearRegression()
mod2.fit(x_train,y_train)
ypred = mod2.predict(x_test)
r2_score(y_test,ypred)

-0.01168590734806485

In [19]:
with open('model.pkl','wb') as fw:
    pickle.dump(mod1,fw)